In [98]:
import pandas as pd
import numpy as np
import ast
import warnings
warnings.filterwarnings('ignore')

In [99]:
df = pd.read_csv('gsearch_jobs.csv')

In [100]:
df = df.drop(df.columns[[1,2]], axis=1)

In [101]:
df

,Unnamed: 0,company_name,location,via,description,extensions,job_id,thumbnail,posted_at,schedule_type,...,commute_time,salary_pay,salary_rate,salary_avg,salary_min,salary_max,salary_hourly,salary_yearly,salary_standardized,description_tokens
0,0,Cisco Meraki,Anywhere,via LinkedIn,"As the leader in cloud-managed IT, Cisco Merak...","['22 hours ago', 'Work from home', 'Full-time'...",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJodGlkb2...,https://encrypted-tbn0.gstatic.com/images?q=tb...,22 hours ago,Full-time,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['tableau', 'sql', 'aws']"
1,1,Midwest Staffing,Anywhere,via LinkedIn,As a Senior Business Analyst you will contribu...,"['53 minutes ago', 'Work from home', 'Full-tim...",eyJqb2JfdGl0bGUiOiJFbnRyeSBMZXZlbCAtIEJ1c2luZX...,https://encrypted-tbn0.gstatic.com/images?q=tb...,53 minutes ago,Full-time,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,[]
2,2,"Amyx, Inc.",United States,via Indeed,Overview:\n\nAmyx is seeking to hire a Data An...,"['3 hours ago', 'Full-time']",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QvUmVzZWFyY2...,NaN,3 hours ago,Full-time,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['sql', 'azure', 'excel']"
3,3,Upwork,Anywhere,via Upwork,I am looking for someone to help me build an A...,"['23 hours ago', 'Work from home', 'Contractor']",eyJqb2JfdGl0bGUiOiJEYXRhIGFuYWx5c3QvQUkgZXhwZX...,NaN,23 hours ago,Contractor,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,['excel']
4,4,Bank Street College of Education,United States,via Higher Education Recruitment Consortium (H...,Position Vacancy – Data Analyst to support the...,"['20 hours ago', 'Full-time']",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJodGlkb2...,NaN,20 hours ago,Full-time,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['excel', 'powerpoint']"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
37175,37175,EDWARD JONES,"Houstonia, MO",via My ArkLaMiss Jobs,"At Edward Jones, we help clients achieve their...","['23 hours ago', '76,798–130,764 a year', 'Ful...",eyJqb2JfdGl0bGUiOiJNYXJrZXRpbmcgRGF0YSBcdTAwMj...,NaN,23 hours ago,Full-time,...,NaN,76798–130764,a year,103781.0,76798.0,130764.0,NaN,103781.0,103781.0,"['power_bi', 'excel', 'r', 'python', 'tableau'..."
37176,37176,EDWARD JONES,"Marshfield, MO",via My ArkLaMiss Jobs,"At Edward Jones, we help clients achieve their...","['23 hours ago', '106,916–182,047 a year', 'Fu...",eyJqb2JfdGl0bGUiOiJMZWFkLURhdGEgQW5hbHlzdCIsIm...,NaN,23 hours ago,Full-time,...,NaN,106916–182047,a year,144481.5,106916.0,182047.0,NaN,144481.5,144481.5,[]
37177,37177,EDWARD JONES,"High Point, MO",via My ArkLaMiss Jobs,"At Edward Jones, we help clients achieve their...","['23 hours ago', '106,916–182,047 a year', 'Fu...",eyJqb2JfdGl0bGUiOiJMZWFkLURhdGEgQW5hbHlzdCIsIm...,NaN,23 hours ago,Full-time,...,NaN,106916–182047,a year,144481.5,106916.0,182047.0,NaN,144481.5,144481.5,[]
37178,37178,EDWARD JONES,"Calhoun, MO",via My ArkLaMiss Jobs,"At Edward Jones, we help clients achieve their...","['23 hours ago', '106,916–182,047 a year', 'Fu...",eyJqb2JfdGl0bGUiOiJMZWFkLURhdGEgQW5hbHlzdCIsIm...,NaN,23 hours ago,Full-time,...,NaN,106916–182047,a year,144481.5,106916.0,182047.0,NaN,144481.5,144481.5,[]
37179,37179,Citi,United States,via My ArkLaMiss Jobs,The Institutional Credit Management (ICM) grou...,"['24 hours ago', '105,850–158,780 a year', 'Fu...",eyJqb2JfdGl0bGUiOiJJbnN0aXR1dGlvbmFsIENyZWRpdC...,https://encrypted-tbn0.gstatic.com/images?q=tb...,24 hours ago,Full-time,...,NaN,105850–158780,a year,132315.0,105850.0,158780.0,NaN,132315.0,132315.0,"['tableau', 'cognos']"

In [102]:
df_clean = df.drop(columns = ['salary','via', 'description','extensions', 'job_id', 'thumbnail', 'posted_at', 'search_term', 'date_time', 'commute_time']).copy()

In [103]:
salary_columns = ['salary_pay', 'salary_rate', 'salary_avg', 'salary_min', 'salary_max', 'salary_hourly', 'salary_yearly']
df_clean.dropna(subset = salary_columns, how='all', inplace=True)

In [104]:
df_clean['schedule_type'] = np.where(df_clean['schedule_type'].str.contains('Full-time', case = False, na=False), 'Full-time', df_clean['schedule_type'])
df_clean['schedule_type'] = np.where(df_clean['schedule_type'].str.contains('Part-time', case = False, na=False), 'Part-time', df_clean['schedule_type'])
df_clean['schedule_type'] = np.where(df_clean['schedule_type'].str.contains('Contractor', case=False, na=False), 'Contractor', df_clean['schedule_type'])
df_clean['schedule_type'] = np.where(df_clean['schedule_type'].isna(), 'Full-time', df_clean['schedule_type'])
df_clean['work_from_home'] = np.where(df_clean['work_from_home'].isna() , 'False', df_clean['work_from_home'])
df_clean['work_from_home'] = df_clean['work_from_home'].astype(str)

In [105]:
for k, row in df_clean.iterrows():
    if row['salary_rate'] == 'a year':
        df_clean.at[k,'yearly_min'] = row['salary_min']
        df_clean.at[k,'yearly_max'] = row['salary_max']
    ### Assuming someone works 40 hours and 52 weeks
    if row['salary_rate'] == 'an hour':
        df_clean.at[k,'yearly_min'] = row['salary_min'] * 40 * 52
        df_clean.at[k,'yearly_max'] = row['salary_max'] * 40 * 52
    ### Assuming someone works the full year
    if row['salary_rate'] == 'a month':
        df_clean.at[k,'yearly_min'] = row['salary_min'] * 12
        df_clean.at[k,'yearly_max'] = row['salary_max'] * 12

In [106]:
for k, row in df_clean.iterrows():
    if (isinstance(row['location'],str)) and row['location'].strip().lower() in ['united states', 'anywhere'] or pd.isna(row['location']) or row['work_from_home'] == 'True':
        df_clean.at[k,'locations'] = 'Remote'
    else:
        df_clean.at[k,'locations'] = row['location']

In [107]:
for index, row in df_clean.iterrows():
    if row['work_from_home'] == 'False' and row['locations'] == 'Remote':
        df_clean.at[index, 'locations'] = 'Unknown'

In [108]:
df_clean['min_yearly'] = df_clean['yearly_min']

In [109]:
df_clean['max_yearly'] = df_clean['yearly_max']

In [110]:
quantile_min = df_clean['min_yearly'].quantile(0.025)
quantile_max = df_clean['max_yearly'].quantile(0.975)

df_clean = df_clean[
    (df_clean['min_yearly'] >= quantile_min) & 
    (df_clean['min_yearly'] <= quantile_max) & 
    (df_clean['max_yearly'] >= quantile_min) & 
    (df_clean['max_yearly'] <= quantile_max)
]

df_clean.drop(['yearly_min', 'yearly_max'], axis=1, inplace=True)

In [111]:
df_clean.drop(columns = ['Unnamed: 0','location','salary_pay', 'salary_avg', 'salary_min', 'salary_max', 'salary_hourly', 'salary_yearly', 'salary_standardized',], inplace=True)

In [112]:
df_clean['state'] = df_clean['locations'].apply(lambda location: location.split(',')[-1].strip() if ',' in location else location)

In [113]:
state_code = {
    'Kansas': 'KS',
    'Missouri': 'MO',
    'Oklahoma': 'OK',
    'AR': 'AR',
    'CA': 'CA',
    'KS': 'KS',
    'NE': 'NE',
    'NJ': 'NJ',
    'TX': 'TX',
    'Remote': 'Remote',
    'Unknown': 'Unknown'}

In [114]:
for index, row in df_clean.iterrows():
    cleaned_state = row['state'].strip()
    if cleaned_state in state_code:
        df_clean.at[index, 'state'] = state_code[cleaned_state]

In [115]:
for index, row in df_clean.iterrows():
    if row['description_tokens'] == '[]':
        df_clean.at[index, 'description_tokens'] = None

In [116]:
## Creating a DataFrame with all unique skills required
df_skill = pd.DataFrame()
def safe_literal_eval(x):
    try:
        if x is not None:
            return ast.literal_eval(x)
        else:
            return []
    except (SyntaxError, ValueError):
        return []
df_clean['description_tokens'] = df_clean['description_tokens'].apply(safe_literal_eval)
unique_skills = set()
for skill_list in df_clean['description_tokens']:
    for skill in skill_list:
        unique_skills.add(skill)
for skill in unique_skills:
    counts = df_clean['description_tokens'].apply(lambda x:
                                                  x.count(skill))
    df_skill[skill] = counts
df_clean.drop(columns = ['description_tokens'], inplace=True)

In [100]:
df_skill.to_csv('Skills.csv', sep=',', index=False, encoding='utf-8')

In [101]:
df_clean.to_csv('Cleaned.csv', sep=',', index=False, encoding='utf-8')

In [21]:
df_clean['state'].unique()

array(['Remote', 'Unknown', 'MO', 'OK', 'KS', 'AR', 'NJ', 'NE', 'CA',
       'TX'], dtype=object)

In [23]:
fips = {
    'MO':29,
    'OK':40,
    'KS':20,
    'AR':0o5,
    'NJ':34,
    'NE':31,
    'CA':0o6,
    'TX':48}

In [118]:
df_clean['high_low_mean'] = (df_clean['min_yearly'] + df_clean['max_yearly']) / 2
df_clean['state_fips'] = df_clean['state'].apply(lambda state: fips.get(state) if state in fips else None)
#temp_df = df_clean.groupby('state_fips')['high_low_mean'].agg(['mean', 'count']).reset_index()
#temp_df.columns = ['fips', 'Mean Salary', 'freq']
df_clean['state_fips']

5         NaN
21        NaN
25        NaN
65        NaN
76        NaN
         ...
37175    29.0
37176    29.0
37177    29.0
37178    29.0
37179     NaN
Name: state_fips, Length: 5858, dtype: float64

In [88]:
import geopandas as gpd

In [87]:
df_clean['state_fips'].dropna()

139      29.0
155      40.0
164      29.0
176      29.0
183      29.0
         ...
37167    29.0
37175    29.0
37176    29.0
37177    29.0
37178    29.0
Name: state_fips, Length: 1112, dtype: float64

In [ ]:
def plot_map():
    counties = load_geopa('./us_census/cb_2018_us_state_5m.shp')
    fips = {
        'MO': 29,
        'OK': 40,
        'KS': 20,
        'AR': 5,
        'NJ': 34,
        'NE': 31,
        'CA': 6,
        'TX': 48}

    df_clean['state_fips'] = df_clean['state'].apply(lambda state: fips.get(state) if state in fips else None)
    temp_df = df_clean.groupby('state_fips')['high_low_mean'].agg(['mean', 'count']).reset_index()
    temp_df.columns = ['STATEFP', 'Mean Salary', 'freq']
    temp_df['STATEFP'] = temp_df['STATEFP'].astype(int)

    fig = px.choropleth_mapbox(temp_df,geojson=counties, locations='STATEFP',color = 'Mean Salary',
                               color_continuous_scale="Blues",
                               range_color=(temp_df['Mean Salary'].min(), temp_df['Mean Salary'].max()),
                               mapbox_style="carto-positron",
                               zoom=3, center={"lat": 37.0902, "lon": -95.7129},
                               opacity=0.5,
                               labels={'freq': 'Mean Salary'}
                               )
    fig.update_layout(margin={"r": 50, "t": 0, "l": 0, "b": 0})
    st.plotly_chart(fig, use_container_width=True)

In [91]:
gdf = gpd.read_file('./us_census/cb_2022_us_state_500k.shp')
gdf.head()

,STATEFP,STATENS,AFFGEOID,GEOID,STUSPS,NAME,LSAD,ALAND,AWATER,geometry
0,35,00897535,0400000US35,35,NM,New Mexico,00,314198573403,726463825,"POLYGON ((-109.05017 31.48000, -109.04984 31.4..."
1,46,01785534,0400000US46,46,SD,South Dakota,00,196341552329,3387681983,"POLYGON ((-104.05788 44.99761, -104.05078 44.9..."
2,06,01779778,0400000US06,06,CA,California,00,403673617862,20291712025,"MULTIPOLYGON (((-118.60442 33.47855, -118.5987..."
3,21,01779786,0400000US21,21,KY,Kentucky,00,102266581101,2384240769,"MULTIPOLYGON (((-89.40565 36.52817, -89.39869 ..."
4,01,01779775,0400000US01,01,AL,Alabama,00,131185042550,4582333181,"MULTIPOLYGON (((-88.05338 30.50699, -88.05109 ..."

In [125]:
df_clean['state_fips'] = df_clean['state'].apply(lambda state: fips.get(state) if state in fips else None)
temp_df = df_clean.groupby('state_fips')['high_low_mean'].agg(['mean', 'count']).reset_index()
temp_df.columns = ['state_fips', 'Mean Salary', 'Frequency']
temp_df['state_fips'] = temp_df['state_fips'].astype(int)
temp_df['Mean Salary'] = temp_df['Mean Salary'].round(2)
df_clean['Mean Salary'].min()

KeyError: 'Mean Salary'

In [ ]:
 fig = go.Figure(data=go.Choropleth(
        locations=['State'],
        locationmode='USA-states',
        z=temp_df['Mean Salary'].round(2),
        text=temp_df,
        marker_line_color='black',
        colorbar_title='USD($)'
    ))